---
kind: other
id: Properties.T:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions
source: html/17c0ce01-8d42-1520-cc18-093db6f0d313.htm
---
# AlignmentStationLabelSetOptions Properties

The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet).
 The default value is null.
 When null, the station value corresponding to the alignment's DisplayedEndStation is used.